In [6]:
# 데이터 베이스의 테이블에서 데이터를 읽어와 데이터 프레임으로 생성한다.
# pymysql, cryptography 필요
# pip install pymysql
# pip install cryptography

import pymysql
import numpy as np
import pandas as pd

# 데이터 베이스 접속 정보를 관리하는 객체
db_connector = pymysql.connect(
    # DBMS가 설치되어 있는 컴퓨터의 도메인 주소나 IP 주소
    host = '127.0.0.1',
    # DBMS에 접속하기 위한 port 번호
    port = 3306,
    # 접속할 계정
    user = 'root',
    # 접속 계정의 비밀번호
    password = 'angel1030!',
    # 사용할 데이터 베이스의 이름
    db = 'employees',
    # 인코딩 타입
    charset='utf8'
)

In [7]:
sql = 'select * from employees'
employees_df = pd.read_sql(sql, db_connector)

sql = "select * from departments"
departments_df = pd.read_sql(sql, db_connector)

sql = "select * from dept_emp where to_date != '9999-01-01'"
dept_emp_df = pd.read_sql(sql, db_connector)

sql = "select * from dept_manager where to_date != '9999-01-01'"
dept_manager_df = pd.read_sql(sql, db_connector)

sql = "select * from salaries where to_date != '9999-01-01'"
salaries_df = pd.read_sql(sql, db_connector)

sql = "select * from titles where to_date != '9999-01-01'"
titles_df = pd.read_sql(sql, db_connector)

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_1473/77889253.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employees_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_1473/77889253.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  departments_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_1473/77889253.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_emp_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_1473/77889253.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_manager_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_1473/77889253.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  salaries_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_1473/77889253.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  titles_df = pd.read_sql(sql, db_connector)

In [5]:
display(employees_df)
display(departments_df)
display(dept_emp_df)
display(dept_manager_df)
display(salaries_df)
display(titles_df)
display(employees_df)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

        emp_no dept_no   from_date     to_date
0        10001    d005  1986-06-26  9999-01-01
1        10002    d007  1996-08-03  9999-01-01
2        10003    d004  1995-12-03  9999-01-01
3        10004    d004  1986-12-01  9999-01-01
4        10005    d003  1989-09-12  9999-01-01
...        ...     ...         ...         ...
331598  499995    d004  1997-06-02  9999-01-01
331599  499996    d004  1996-05-13  9999-01-01
331600  499997    d005  1987-08-30  9999-01-01
331601  499998    d002  1993-12-27  9999-01-01
331602  499999    d004  1997-11-30  9999-01-01

[331603 rows x 4 columns]

    emp_no dept_no   from_date     to_date
0   110022    d001  1985-01-01  1991-10-01
1   110039    d001  1991-10-01  9999-01-01
2   110085    d002  1985-01-01  1989-12-17
3   110114    d002  1989-12-17  9999-01-01
4   110183    d003  1985-01-01  1992-03-21
5   110228    d003  1992-03-21  9999-01-01
6   110303    d004  1985-01-01  1988-09-09
7   110344    d004  1988-09-09  1992-08-02
8   110386    d004  1992-08-02  1996-08-30
9   110420    d004  1996-08-30  9999-01-01
10  110511    d005  1985-01-01  1992-04-25
11  110567    d005  1992-04-25  9999-01-01
12  110725    d006  1985-01-01  1989-05-06
13  110765    d006  1989-05-06  1991-09-12
14  110800    d006  1991-09-12  1994-06-28
15  110854    d006  1994-06-28  9999-01-01
16  111035    d007  1985-01-01  1991-03-07
17  111133    d007  1991-03-07  9999-01-01
18  111400    d008  1985-01-01  1991-04-08
19  111534    d008  1991-04-08  9999-01-01
20  111692    d009  1985-01-01  1988-10-17
21  111784    d009  1988-10-17  1992-09-08
22  111877    d009  1992-09-08  1996-01-03
23  111939    d009  1996-01-03  9999-01-01

         emp_no  salary   from_date     to_date
0         10001   60117  1986-06-26  1987-06-26
1         10001   62102  1987-06-26  1988-06-25
2         10001   66074  1988-06-25  1989-06-25
3         10001   66596  1989-06-25  1990-06-25
4         10001   66961  1990-06-25  1991-06-25
...         ...     ...         ...         ...
2844042  499999   63707  1997-11-30  1998-11-30
2844043  499999   67043  1998-11-30  1999-11-30
2844044  499999   70745  1999-11-30  2000-11-29
2844045  499999   74327  2000-11-29  2001-11-29
2844046  499999   77303  2001-11-29  9999-01-01

[2844047 rows x 4 columns]

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

### 연습문제 - 나중에 시간날 때 해볼 것
- 사원들의 정보 중 사원번호, first_name 을 가져온다.
- 사원의 사원번호와 생년월일, 성별을 가져온다.
- 부서의 부서번호, 부서 이름을 가져온다.
- 각 사원의 사원번호, 급여액을 가져온다.
- 각 사원의 사원번호, 직함 이름을 가져온다.
- 모든 사원들의 급여를 1000씩 인상한다.
- 모든 사원들의 급여를 1000씩 인하한다.
- 각 사원들의 급여를 10% 인상한 급여액을 가져온다. (1.1을 곱해주세요)
- 각 사원들의 직함을 중복되지 않게 가져온다.
- d005 부서 매니저 사원의 사원번호, 부서 번호를 가져온다.
- 급여가 150000 이상인 사원들의 사원 번호, 급여를 가져온다.
- 급여가 40000 이하인 사원들의 사원번호, 급여를 가져온다.
- 1986년 01월 01일 이후(포함)에 입사한 사원들의 사원번호, 입사일을 가져온다.
- 1990년 01월 01일 이후(포함)부터 매니저로 근무하고 있는 사원들의 사원번호, 부서번호, 
- 1990년 01월 01일 이전(포함X)에 입사한 사원들의 사원번호, 입사일을 가져온다.
- d001 부서의 매니저 중에 1990년 01월 01일(포함) 이후부터 매니저인 사원의 사원 번호, 부서 번호, 매니저 시작 날짜를 가져온다.
- d001 부서 또는 d002 부서의 매니저 사원의 사원 번호, 부서 번호를 가져온다.
- d001 부서에 근무하지 않는 사원들의 사원번호와 근무 부서 번호를 가져온다.
- 1990년 01월 01일 이후(포함)에 입사한 남자 사원의 사원 번호, 성별, 입사일을 가져온다.
- 1990년 01월 01일 이후(포함)부터 60000 이상의 급여를 받은 사원의 사원 번호, 급여, 급여 수령 시작 날짜를 가져온다.
- 직함이 Staff인 사원이거나 Engineer 인 사원의 사원번호, 직함을 가져온다.
- d003 부서의 매니저가 아닌 매니저의 사원번호, 부서 번호를 가져온다.
- 현재 d001 부서에 근무하고 있는 사원들의 사원번호, 근무부서 번호를 가져온다.
- 현재 급여를 60000 이하(포함)로 받는 사원들의 사원번호와 급여액을 가져온다.
- 급여가 60000이상 70000 이하인 사원들의 사원번호, 급여를 가져온다.
- 특정 컬럼의 값이 0000 이상이고 0000 이하인 조건은 between and로 사용할 수 있다.
- d001 부서 또는 d002 부서 또는 d003 부서에 근부하고 있는 사원들의 사원번호, 부서번호를 가져온다.
- d001 부서와 d002 부서의 사원이 아닌 사원들의 사원번호와 부서 번호를 가져온다.
- 사원들의 사원번호와 급여액을 가져온다. 급여액은 1988년에 받은 급여액이다.

- 사원들의 정보 중 사원번호, first_name 을 가져온다.
- 각 사원의 사원번호, 급여액을 가져온다.
- d005 부서 매니저 사원의 사원번호, 부서 번호를 가져온다.
- 급여가 150000 이상인 사원들의 사원 번호, 급여를 가져온다.
- 1986년 01월 01일 이후(포함)에 입사한 사원들의 사원번호, 입사일을 가져온다.
- d001 부서의 매니저 중에 1990년 01월 01일(포함) 이후부터 매니저인 사원의 사원 번호, 부서 번호, 매니저 시작 날짜를 가져온다.
- d001 부서 또는 d002 부서의 매니저 사원의 사원 번호, 부서 번호를 가져온다.
- 직함이 Staff인 사원이거나 Engineer 인 사원의 사원번호, 직함을 가져온다.
- d003 부서의 매니저가 아닌 매니저의 사원번호, 부서 번호를 가져온다.
- 특정 컬럼의 값이 0000 이상이고 0000 이하인 조건은 between and로 사용할 수 있다.

In [10]:
# 1990년 01월 01일 이후(포함)부터 매니저로 근무하고 있는 사원들의 사원번호, 부서번호를 가져온다.

dept_manager_df['to_date'] = pd.to_datetime(dept_manager_df['to_date'])
dept_manager_df.info()

dept_manager_df.query('to_date > "1990-01-01"')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_no     15 non-null     int64
 1   dept_no    15 non-null     object
 2   from_date  15 non-null     object
 3   to_date    15 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 612.0+ bytes

    emp_no dept_no   from_date    to_date
0   110022    d001  1985-01-01 1991-10-01
2   110183    d003  1985-01-01 1992-03-21
4   110344    d004  1988-09-09 1992-08-02
5   110386    d004  1992-08-02 1996-08-30
6   110511    d005  1985-01-01 1992-04-25
8   110765    d006  1989-05-06 1991-09-12
9   110800    d006  1991-09-12 1994-06-28
10  111035    d007  1985-01-01 1991-03-07
11  111400    d008  1985-01-01 1991-04-08
13  111784    d009  1988-10-17 1992-09-08
14  111877    d009  1992-09-08 1996-01-03

In [11]:
#사원들의 정보 중 사원번호, first_name 을 가져온다.

employees_df[['emp_no','first_name']]

        emp_no first_name
0        10001     Georgi
1        10002    Bezalel
2        10003      Parto
3        10004  Chirstian
4        10005    Kyoichi
...        ...        ...
300019  499995     Dekang
300020  499996       Zito
300021  499997    Berhard
300022  499998   Patricia
300023  499999     Sachin

[300024 rows x 2 columns]

In [12]:
#각 사원의 사원번호, 급여액을 가져온다.
salaries_df[['emp_no','salary']]

         emp_no  salary
0         10001   60117
1         10001   62102
2         10001   66074
3         10001   66596
4         10001   66961
...         ...     ...
2603918  499998   51182
2603919  499999   63707
2603920  499999   67043
2603921  499999   70745
2603922  499999   74327

[2603923 rows x 2 columns]

In [14]:
#d005 부서 매니저 사원의 사원번호, 부서 번호를 가져온다.
dept_manager_df.query('dept_no == "d005"')[['emp_no','dept_no']]

   emp_no dept_no
6  110511    d005

In [15]:
#급여가 150000 이상인 사원들의 사원 번호, 급여를 가져온다.
salaries_df.query('salary > 150000')[['emp_no','salary']]

         emp_no  salary
291734    43624  151115
291735    43624  153166
291736    43624  153458
291737    43624  157821
329545    47978  151929
615850    80823  151768
863975   109334  151484
863976   109334  154885
863977   109334  155377
863978   109334  154888
913977   205000  151596
1195572  237542  150994
1338274  253939  150378
1338275  253939  154227
1342726  254466  150754
1342727  254466  152576
1447672  266526  151080
1534562  276633  150467
2544934  493158  150993
2544935  493158  151565
2544936  493158  152208

In [20]:
#1986년 01월 01일 이후(포함)에 입사한 사원들의 사원번호, 입사일을 가져온다.
employees_df['hire_date'] = pd.to_datetime(employees_df['hire_date'])
employees_df.query('hire_date >= "1986-01-01"')[['emp_no','hire_date']]

        emp_no  hire_date
0        10001 1986-06-26
2        10003 1986-08-28
3        10004 1986-12-01
4        10005 1989-09-12
5        10006 1989-06-02
...        ...        ...
300019  499995 1993-01-12
300020  499996 1990-09-27
300021  499997 1986-04-21
300022  499998 1993-10-13
300023  499999 1997-11-30

[264708 rows x 2 columns]

In [23]:
#d001 부서의 매니저 중에 1990년 01월 01일(포함) 이후부터 매니저인 사원의 사원 번호, 부서 번호, 매니저 시작 날짜를 가져온다.
dept_manager_df['from_date'] = pd.to_datetime(dept_manager_df['from_date'] )
dept_manager_df.query('from_date >= "1990-01-01" and dept_no == "d001"')[['emp_no','dept_no','from_date']]

Empty DataFrame
Columns: [emp_no, dept_no, from_date]
Index: []

In [25]:
#d001 부서 또는 d002 부서의 매니저 사원의 사원 번호, 부서 번호를 가져온다.

dept_manager_df.query('dept_no == "d001" or dept_no == "d002"')[['emp_no','dept_no']]

   emp_no dept_no
0  110022    d001
1  110085    d002

In [27]:
#직함이 Staff인 사원이거나 Engineer 인 사원의 사원번호, 직함을 가져온다.
titles_df.query('title == "Staff" or title == "Engineer"')[['emp_no','title']]

        emp_no     title
0        10004  Engineer
1        10005     Staff
2        10007     Staff
5        10009  Engineer
6        10011     Staff
...        ...       ...
203179  499992     Staff
203180  499994  Engineer
203181  499996  Engineer
203182  499997  Engineer
203183  499998     Staff

[165885 rows x 2 columns]

In [28]:
#d003 부서의 매니저가 아닌 매니저의 사원번호, 부서 번호를 가져온다.
dept_manager_df.query('dept_no != "d003"')[['emp_no','dept_no']]

    emp_no dept_no
0   110022    d001
1   110085    d002
3   110303    d004
4   110344    d004
5   110386    d004
6   110511    d005
7   110725    d006
8   110765    d006
9   110800    d006
10  111035    d007
11  111400    d008
12  111692    d009
13  111784    d009
14  111877    d009

---
### Teacher's Version

In [9]:
# object 타입으로 되어 있는 날짜 컬럼들을 날짜 타입으로 변환해준다.
employees_df['hire_date'] = pd.to_datetime(employees_df['hire_date'])
dept_emp_df['from_date'] = pd.to_datetime(dept_emp_df['from_date'])
dept_emp_df['to_date'] = pd.to_datetime(dept_emp_df['to_date'])
dept_manager_df['from_date'] = pd.to_datetime(dept_manager_df['from_date'])
dept_manager_df['to_date'] = pd.to_datetime(dept_manager_df['to_date'])
salaries_df['from_date'] = pd.to_datetime(salaries_df['from_date'])
salaries_df['to_date'] = pd.to_datetime(salaries_df['to_date'])
titles_df['from_date'] = pd.to_datetime(titles_df['from_date'])
titles_df['to_date'] = pd.to_datetime(titles_df['to_date'])

In [10]:
# - 사원들의 정보 중 사원번호, first_name 을 가져온다.
df1 = employees_df[['emp_no', 'first_name']]
df1

        emp_no first_name
0        10001     Georgi
1        10002    Bezalel
2        10003      Parto
3        10004  Chirstian
4        10005    Kyoichi
...        ...        ...
300019  499995     Dekang
300020  499996       Zito
300021  499997    Berhard
300022  499998   Patricia
300023  499999     Sachin

[300024 rows x 2 columns]

In [11]:
# - 각 사원의 사원번호, 급여액을 가져온다.
df1 = salaries_df[['emp_no', 'salary']]
df1

         emp_no  salary
0         10001   60117
1         10001   62102
2         10001   66074
3         10001   66596
4         10001   66961
...         ...     ...
2603918  499998   51182
2603919  499999   63707
2603920  499999   67043
2603921  499999   70745
2603922  499999   74327

[2603923 rows x 2 columns]

In [12]:
# - d005 부서 매니저 사원의 사원번호, 부서 번호를 가져온다.
df1 = dept_manager_df.query('dept_no == "d005"')
df2 = df1[['emp_no', 'dept_no']]
df2

   emp_no dept_no
6  110511    d005

In [13]:
# - 급여가 150000 이상인 사원들의 사원 번호, 급여를 가져온다.
df1 = salaries_df.query('salary >= 150000')
df2 = df1[['emp_no', 'salary']]
df2

         emp_no  salary
291734    43624  151115
291735    43624  153166
291736    43624  153458
291737    43624  157821
329545    47978  151929
615850    80823  151768
863975   109334  151484
863976   109334  154885
863977   109334  155377
863978   109334  154888
913977   205000  151596
1195572  237542  150994
1338274  253939  150378
1338275  253939  154227
1342726  254466  150754
1342727  254466  152576
1447672  266526  151080
1534562  276633  150467
2544934  493158  150993
2544935  493158  151565
2544936  493158  152208

In [14]:
# - 1986년 01월 01일 이후(포함)에 입사한 사원들의 사원번호, 입사일을 가져온다.
df1 = employees_df.query('hire_date >= "1986-01-01"')
df2 = df1[['emp_no', 'hire_date']]
df2

        emp_no  hire_date
0        10001 1986-06-26
2        10003 1986-08-28
3        10004 1986-12-01
4        10005 1989-09-12
5        10006 1989-06-02
...        ...        ...
300019  499995 1993-01-12
300020  499996 1990-09-27
300021  499997 1986-04-21
300022  499998 1993-10-13
300023  499999 1997-11-30

[264708 rows x 2 columns]

In [15]:
# - d001 부서의 매니저 중에 1990년 01월 01일(포함) 이후부터 매니저인 
# 사원의 사원 번호, 부서 번호, 매니저 시작 날짜를 가져온다.
df1 = dept_manager_df.query("dept_no == 'd001' and from_date >= '1990-01-01'")
df2 = df1[['emp_no', 'dept_no', 'from_date']]
df2

Empty DataFrame
Columns: [emp_no, dept_no, from_date]
Index: []

In [16]:
# - d001 부서 또는 d002 부서의 매니저 사원의 사원 번호, 부서 번호를 가져온다.
df1 = dept_manager_df.query('dept_no == "d001" or dept_no == "d002"')
df2 = df1[['emp_no', 'dept_no']]
display(df2)

list1 = ['d001', 'd002']
df1 = dept_manager_df.query('dept_no in @list1')
df2 = df1[['emp_no', 'dept_no']]
display(df2)

   emp_no dept_no
0  110022    d001
1  110085    d002

   emp_no dept_no
0  110022    d001
1  110085    d002

In [17]:
# - 직함이 Staff인 사원이거나 Engineer 인 사원의 사원번호, 직함을 가져온다.
df1 = titles_df.query('title == "Staff" or title == "Engineer"')
df2 = df1[['emp_no', 'title']]
display(df2)

list1 = ['Staff', 'Engineer']
df1 = titles_df.query('title in @list1')
df2 = df1[['emp_no', 'title']]
display(df2)

        emp_no     title
0        10004  Engineer
1        10005     Staff
2        10007     Staff
5        10009  Engineer
6        10011     Staff
...        ...       ...
203179  499992     Staff
203180  499994  Engineer
203181  499996  Engineer
203182  499997  Engineer
203183  499998     Staff

[165885 rows x 2 columns]

        emp_no     title
0        10004  Engineer
1        10005     Staff
2        10007     Staff
5        10009  Engineer
6        10011     Staff
...        ...       ...
203179  499992     Staff
203180  499994  Engineer
203181  499996  Engineer
203182  499997  Engineer
203183  499998     Staff

[165885 rows x 2 columns]

In [18]:
# - d003 부서의 매니저가 아닌 매니저의 사원번호, 부서 번호를 가져온다.
df1 = dept_manager_df.query('dept_no != "d003"')
df2 = df1[['emp_no', 'dept_no']]
df2

    emp_no dept_no
0   110022    d001
1   110085    d002
3   110303    d004
4   110344    d004
5   110386    d004
6   110511    d005
7   110725    d006
8   110765    d006
9   110800    d006
10  111035    d007
11  111400    d008
12  111692    d009
13  111784    d009
14  111877    d009